<template>
  <v-modal class="modal-rules">
    <div class="blur-bg"></div>
    <h4 class="modal-rules__title">
      Правила участия в маркетинговом мероприятии «Верный»
    </h4>
    <v-scroller>
      <div class="modal-rules__content" ref="content">
        <p>
          1. Общие положения: 1.1 Настоящие Правила содержат сведения о
          маркетинговом мероприятии с использованием цифровой игры «Найди свой
          клад в ДИКСИ» (далее - Акция). 1.2 Проводимая Акция не является
          лотереей или стимулирующей лотереей, не является азартной игрой или
          пари. 1.3 Организатор гарантирует, что при определении возможности
          получения поощрений не используются алгоритмы или процедуры, которые
          могут определить результаты Акции до начала ее проведения. 1.4
          Денежный эквивалент бонусов и поощрений Участникам Акции не выдается.
          1.5 Факт участия в Акции означает, что Участник Акции ознакомлен с
          условиями Акции и полностью согласен с ними. 1.6 Сотрудники
          Организатора не оказывают помощь Участникам Акции по выходу онлайн в
          Интернет.
        </p>
        <p>
          2. Организатор Акции: 2.1. Организатор Акции: 2.1.1. Наименование —
          Акционерное общество «ДИКСИ ЮГ» (АО «ДИКСИ ЮГ»); 2.1.2.
          ОГРН:1035007202460; ИНН: 5036045205; 2.1.3. Юр. Адрес: Россия, 142119,
          Московская область, Г. Подольск, ул. Юбилейная, д. 32А 2.2.
          Организатор Акции имеет право: 2.2.1. Отменить проведение Акции до ее
          начала при условии уведомления Участников Акции о такой отмене путем
          размещения соответствующего объявления на сайте www.dixy.ru.
        </p>
      </div>
    </v-scroller>
  </v-modal>
</template>
<script>
import VModal from "./VModal";
import VScroller from "../../molecules/VScroller";
export default {
  name: "VModalRules",
  components: {
    VScroller,
    VModal
  },
  data() {
    return {
      height: 700
    };
  },
  computed: {
    offsetHeight() {
      return (this.height / this.$refs.content.offsetHeight) * 100;
    }
  }
};
</script>
<style lang="scss">
.blur-bg {
  position: absolute;
  width: 100%;
  height: 100vh;
  top: 0;
  left: 0;
  filter: blur(4px);
}
.modal-rules {
  padding: 0 80px 0 20px;
  .v-scroller {
    max-height: 700px;
  }
  &__title {
    font-size: 20px;
    font-weight: 500;
    color: #949494;
    margin-bottom: 40px;
  }
  &__scrollbar {
    top: 0px;
    right: 20px;
  }
}

</style>
